local function run(msg)
if msg.text == "hi" then
	return "Hello bb"
end
if msg.text == "Hi" then
	return "Hello honey"
end
if msg.text == "Hello" then
	return "Hi bb"
end
if msg.text == "hello" then
	return "Hi honey"
end
if msg.text == "Salam" then
	return "Salam aleykom"
end
if msg.text == "salam" then
	return "و علیکم السلام"
end
if msg.text == "MaxBot" then
	return "Best Bot In The World!"
end
if msg.text == "MAXBOT" then
	return "Best Bot In The World"
end
if msg.text == "Maxbot" then
	return "Yes?"
end
if msg.text == "maxbot" then
	return "اومده اسپمرا رو بگاد😀"
end
if msg.text == "bot" then
	return "hum?"
end
if msg.text == "Bot" then
	return "Huuuum?"
end
if msg.text == "?" then
	return "Hum??"
end
if msg.text == "Bye" then
	return "Babay"
end
if msg.text == "bye" then
	return "Bye Bye"
end
if msg.text == "سلام" then
	return "سلام عمو"
end 
if msg.text == "کیر" then
	return "تو کونت"
end
 if msg.text == "کون" then
	return "ژووووووووووون"
end
if msg.text == "ممه" then
	return "ژوووووون 85 باشه ها"
end
if msg.text == "کیری" then
	return "عه؟ اسمت این بود؟"
end
if msg.text == "bk" then
	return "به کیرم که به کیرت"
end
if msg.text == "Hossein" then
	return "با باباییم چیکار داری؟ "
end
if msg.text == "حسین" then
	return "با باباییم چیکار داری؟ "
end
if msg.text == "hossein" then
	return "با باباییم چیکار داری؟ "
end
if msg.text == "slm" then
	return "سلام کونی"
end
if msg.text == "کونی" then
	return "میدونم این اسمته"
end
if msg.text == "help" then
	return "➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⛔️دستورات اداره ی گروه⛔️
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
🔰  نصب مقام ( مقام ) : 
🔹 برای تعلق دادن مقام مورد نظر به شخص مورد نظر با ریپلی
------------------------------------------------------------------------------------------------------------
🔰 اطلاعات ( ای دی/نام کاربری) : 
🔹  برای مشاهده ی اطلاعات شخص مورد نظر ( با ریپلی هم میشه )
------------------------------------------------------------------------------------------------------------
🔰  لیست مسدودان : 
🔹  برای مشاهده ی لیست افراد مسدود شده ی گروه 
------------------------------------------------------------------------------------------------------------
🔰  صلب مسدود : 
🔹 برای دراوردن شخص از مسدودیت گروه
------------------------------------------------------------------------------------------------------------
🔰  مسدود : 
🔹 برای مسدود کردن شخص از گروه تا دیگه نتونه بیاد
------------------------------------------------------------------------------------------------------------
🔰  اخراج : 
🔹 برای اخراج کردن شخص از گروه استفاده میشود ( با ریپلی هم میشه ) 
------------------------------------------------------------------------------------------------------------
🔰  (نصب/صلب) : 
🔹  برای (اضافه/حذف) کردن گروه (به/از) گروه های ربات.
------------------------------------------------------------------------------------------------------------
🔰  (نصب/صلب) ریلم : 
🔹  برای (اضافه/حذف) کردن ریلم (به/از) ریلم های ربات.
------------------------------------------------------------------------------------------------------------
🔰  (قوانین/توضیحات) : 
🔹  برای دیدن (قوانین/توضیحات) گروه استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  نصب (عکس/اسم) :
🔹  برای تعویض یا گذاشتن (عکس/اسم) گروه استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  ارتقا : 
🔹  برای ارتقا دادن شخصی به عنوان مدیر ( با ریپلی هم میشه ) 
------------------------------------------------------------------------------------------------------------
🔰  پاک کردن (قوانین/لیست مدیران/توضیحات) : 
🔹  برای پاک کردن (قوانین/لیست مدیران/توضیحات)  گروهتان استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  حذف مدیر : 
🔹  برای حذف کردن مدیریت یکی از مدیران ( با ریپلی هم میشه ) 
------------------------------------------------------------------------------------------------------------
🔰  تنظیم (قوانین/توضیحات) : 
🔹  برای تنظیم کردن (قوانین/توضیحات)  برای گروه .
------------------------------------------------------------------------------------------------------------
🔰  (قفل/باز کردن) [همه/استیکر/اسم/ورود/عکس/اسپم/فارسی/تبلیغ/انگلیسی/فحش/تگ/خروج/ربات]
🔹  برای بازکردن یا قفل  [همه/استیکر/اسم/ورود/عکس/اسپم/فارسی/تبلیغ/انگلیسی/فحش/تگ/خروج/ربات] در گروه استفاده میشود . 
------------------------------------------------------------------------------------------------------------
🔰  نصب مالک :
🔹  برای ارقای شخصی به عنوان مالک (سازنده) گروه استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  در مورد (نام کاربری) :
🔹  برای دادن ای دی  و اسم شخص استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  حساسیت (عدد) : 
🔹  برای تنظیم حساسیت ربات به اسپم به تعدادی که میدهیم.
------------------------------------------------------------------------------------------------------------
🔰  تنظیمات :
🔹  برای مشاهده ی تنظیمات گروه .
------------------------------------------------------------------------------------------------------------
🔰  لیست مدیران : 
🔹  برای دیدن لیست مدیران استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  لینک : 
🔹  برای دریافت لینک گروه استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰  لینک جدید : 
🔹 برای دریافت لینک جدید گروه استفاده میشود.
------------------------------------------------------------------------------------------------------------
🔰 اخراج غیر فعال :
🔹 برای اخراج کردن غیر فعال ها استفاده میشود . 
------------------------------------------------------------------------------------------------------------
🔰 ای دی :
🔹 فقط با ریپلی میتوانید از این دستور برای ای دی گرفتن شخصی استفاده کنید
------------------------------------------------------------------------------------------------------------
 نکته !!!! :   با دستور *اخراجم کن* میتوانید از گروه بروید . 
------------------------------------------------------------------------------------------------------------"
end
end

return {
	description = "Chat With Robot Server", 
	usage = "chat with robot",
	patterns = {
		"^Hi$",
		"^hello$",
		"^Bye$",
		"^?$",
		"^Salam$",
                "^حسین$", 
                "^سلام$",
                "^کیر$",
                "^کون$",
                "^کونی$",
                "^کیری$",
                "^ممه$",
                "^hi$",
                "^Hello$", 
                "^salam$",
                "^Maxbot$",
                "^maxbot$", 
                "^MAXBOT$",
                "^MaxBot$",
                "^bk$", 
                "^slm$",
                "^help$"
		}, 
	run = run,
    --privileged = true,
	pre_process = pre_process
}
